tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "homebrew/bundle"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

brew "aspell"
brew "bat"
brew "clojure"
brew "cmake"
brew "code-cli"
brew "coreutils"
brew "difftastic"
brew "dust"
brew "fd"
brew "fzf"
brew "gh"
brew "gnupg"
brew "go"
brew "harfbuzz"
brew "hexyl"
brew "htop"
brew "hugo"
brew "jet"
brew "jq"
brew "leiningen"
brew "libvterm" # for emacs vterm
brew "libyaml"  # modern versions of ruby want this
brew "lsd"
brew "mosh"
brew "mise"     # manage versions of langs (java, ruby, etc)
brew "node"
brew "pandoc"
brew "pinentry-mac"
brew "postgresql@16", restart_service: true, link: true
brew "procs"
brew "ripgrep"
brew "rlwrap"
brew "rust-analyzer"
brew "rustup-init"
brew "tmux"
brew "tree"
brew "watch"
brew "wget"
brew "xsv"
brew "yq"

brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "railwaycat/emacsmacport/emacs-mac"

cask "arc"
cask "maccy"
cask "font-fira-code"
cask "font-hack"
cask "font-hack-nerd-font"
