tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "railwaycat/emacsmacport"

brew "aspell"
brew "bat"
brew "harfbuzz"
brew "clojure"
brew "cmake"
brew "code-cli"
brew "coreutils"
brew "docker"
brew "docker-compose"
brew "dust"
brew "exa"
brew "fd"
brew "gh"
brew "gnupg"
brew "go"
brew "hexyl"
brew "htop"
brew "hugo"
brew "jet"
brew "jq"
brew "leiningen"
brew "libvterm"
brew "mosh"
brew "node"
brew "pandoc"
brew "postgresql@15", restart_service: true, link: true
brew "ripgrep"
brew "rustup-init"
brew "tmux"
brew "tree"
brew "xsv"
brew "zola"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "railwaycat/emacsmacport/emacs-mac"
cask "font-fira-code"
cask "font-hack"
