tap "borkdude/brew"
tap "clojure-lsp/brew"
tap "railwaycat/emacsmacport"
tap "homebrew/bundle"
tap "homebrew/services"

brew "aspell"
brew "borkdude/brew/babashka"
brew "borkdude/brew/clj-kondo"
brew "clojure"
brew "clojure-lsp/brew/clojure-lsp-native"
brew "cmake"
brew "coreutils"
brew "dust"
brew "exa"
brew "fd"
brew "gh"
brew "go"
brew "harfbuzz"
brew "htop"
brew "hugo"
brew "jet"
brew "jq"
brew "libvterm"
brew "node"
brew "postgresql@15", restart_service: true, link: true
brew "railwaycat/emacsmacport/emacs-mac"
brew "ripgrep"
brew "rustup-init"
brew "tmux"
